%光电子综合实验第一次实验的拟合程序



clc;
close all;
clear;
%% 程序开始
%测量点10个
x = 0:20:200;
delta = x*10^(-6);
%光纤长度15cm
L = 0.15;
m = 0:10;
%拉伸值
Str = [1549.487
1549.634
1549.859
1550.069
1550.263
1550.441
1550.632
1550.792
1550.962
1551.110
1551.259
];
%回缩值
Retr = [1549.485
1549.631
1549.850
1550.054
1550.254
1550.437
1550.627
1550.790
1550.963
1551.114
1551.257
];
%平均值
avg = [1549.486
1549.633
1549.855
1550.062
1550.259
1550.439
1550.630
1550.791
1550.963
1551.112
1551.258
];

%% 开始拟合
E = delta/L;

uE = 10^6*E;
%最小二乘法
p = polyfit(uE,avg,1);

y = p(1)*uE+p(2);                                                %列出最终多项式 
%% 绘图
figure;
plot(uE,Str,'-g');                                                      %绘出数据点，用绿色“.”表示
hold on;
plot(uE,Retr);
xlabel('με(um)','fontsize',14);
ylabel('波长λ(nm)','fontsize',14);
axis([-200,1400,1549.4,1551.4]);
legend('拉伸','回缩');

figure;
plot(uE,avg,'r');
xlabel('με(um)','fontsize',14);
ylabel('波长λ(nm)','fontsize',14);
axis([-200,1400,1549.4,1551.4]);

figure;
plot(uE,y,'r');
xlabel('με(um)','fontsize',14);
ylabel('波长λ(nm)','fontsize',14);
axis([-200,1400,1549.4,1551.4]);
